from typing import Any


class Log:
    """Класс помощник служащий для урегулирования и стандартизирования
        процесса логирования действий происходящий в классе,
        где данный класс был инициализирован

    Класс подразумевает динамическое создание атрибутов класс с хранением
        необходимой информацией.

    Работа с классом не подразумевает явное ручное добавление элементов
        в проуессе написание игровых элементов и служит только для получения
        информации.
    """

    def __setattr__(self, key, value: list) -> None:
        """Переопределена логика на добавление элементов к уже существующему,
        при присваивании"""
        if not self.__dict__.get(key):
            object.__setattr__(self, key, value)

        else:
            if isinstance(self.__dict__[key], list):
                self.__dict__[key].extend(value)

    def __getattr__(self, item) -> Any:
        """Переопределен для исключения получения ошибки при обращении к
            несуществующим атрибутом."""
        return self.__dict__.get(item)
